Ran Plan for project: `notes-app` dir: `app-infra/notes-app/root-tf` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.iam.data.aws_eks_cluster.this: Reading...
module.iam.data.aws_caller_identity.current: Reading...
module.rds.data.aws_vpc.selected: Reading...
module.iam.data.aws_caller_identity.current: Read complete after 0s [id=985539781206]
module.iam.data.aws_eks_cluster.this: Read complete after 0s [id=mgmt-cluster]
module.iam.data.aws_iam_openid_connect_provider.this: Reading...
module.iam.data.aws_iam_openid_connect_provider.this: Read complete after 0s [id=arn:aws:iam::985539781206:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/FC0D637E14CD3D170D44594D455232EA]
module.rds.data.aws_vpc.selected: Read complete after 0s [id=vpc-0df13ab5c2a1d8f36]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.iam.aws_iam_policy.app_policy will be created
+ resource "aws_iam_policy" "app_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Permissions for auth-gateway and notes API"
      + id               = (known after apply)
      + name             = "notes-app-irsa-role-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.iam.aws_iam_role.app_irsa will be created
+ resource "aws_iam_role" "app_irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.us-east-1.amazonaws.com/id/FC0D637E14CD3D170D44594D455232EA:sub" = "system:serviceaccount:notes-app:notes-app-sa"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::985539781206:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/FC0D637E14CD3D170D44594D455232EA"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "notes-app-irsa-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.iam.aws_iam_role_policy_attachment.app_policy_attach will be created
+ resource "aws_iam_role_policy_attachment" "app_policy_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "notes-app-irsa-role"
    }

  # module.rds.aws_db_instance.this will be created
+ resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "notes"
      + db_subnet_group_name                  = "notes-app-db-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "8.0"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "notes-app-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Name" = "notes-app-db"
        }
      + tags_all                              = {
          + "Name" = "notes-app-db"
        }
      + timezone                              = (known after apply)
      + username                              = "admin"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.rds.aws_db_subnet_group.db will be created
+ resource "aws_db_subnet_group" "db" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "notes-app-db-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-0710690d90c6d77ff",
          + "subnet-0ea4f9d43e57530ed",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "notes-app-db-subnet-group"
        }
      + tags_all                = {
          + "Name" = "notes-app-db-subnet-group"
        }
      + vpc_id                  = (known after apply)
    }

  # module.rds.aws_secretsmanager_secret.db will be created
+ resource "aws_secretsmanager_secret" "db" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "notes-app-db-secret"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)
    }

  # module.rds.aws_secretsmanager_secret_version.db will be created
+ resource "aws_secretsmanager_secret_version" "db" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.rds.aws_security_group.rds will be created
+ resource "aws_security_group" "rds" {
      + arn                    = (known after apply)
      + description            = "RDS access for notes-app-db"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = ""
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3306
            },
        ]
      + name                   = "notes-app-db-rds-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "notes-app-db-rds-sg"
        }
      + tags_all               = {
          + "Name" = "notes-app-db-rds-sg"
        }
      + vpc_id                 = "vpc-0df13ab5c2a1d8f36"
    }

  # module.rds.random_password.db will be created
+ resource "random_password" "db" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 20
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p notes-app
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis-74fd7c45b6-kd49t:4141/lock?id=mr26%252Fplatform-sre-devops-lab%252Fapp-infra%252Fnotes-app%252Froot-tf%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p notes-app
  ```
Plan: 9 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```